app/Http/Controllers/Doctors/DoctorsController.php

select * from `specialists` where `specialists`.`user_id` in (3)
select * from `users`
---
    public function index()
    {
        $doctors = Specialist::with(['user', 'category','scores'])->get();

select * from `categories` where `categories`.`id` in (1)
---
    public function show(Specialist $specialist)
    {
        $specialist->load('user', 'category');